Revit 2027 API
FabricationPart.HasCustomData Method
 Check if fabrication part contains custom data already.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasCustomData(
	int customId
)
Public Function HasCustomData (
	customId As Integer
) As Boolean
public:
bool HasCustomData(
	int customId
)
member HasCustomData :
        customId : int -> bool
Parameters
customId Int32
 The identifier of the custom data field to look for.
Return Value
Boolean
 Returns true if the fabrication part contains the custom data.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace